7767517
68 70
Input            input                    0 1 input
Convolution      163                      1 1 input 163 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=432
ReLU             165                      1 1 163 165
ConvolutionDepthWise 166                      1 1 165 166 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=144 7=16
ReLU             168                      1 1 166 168
Convolution      169                      1 1 168 169 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
ReLU             171                      1 1 169 171
ConvolutionDepthWise 172                      1 1 171 172 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=288 7=32
ReLU             174                      1 1 172 174
Convolution      175                      1 1 174 175 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
ReLU             177                      1 1 175 177
ConvolutionDepthWise 178                      1 1 177 178 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
ReLU             180                      1 1 178 180
Convolution      181                      1 1 180 181 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
ReLU             183                      1 1 181 183
ConvolutionDepthWise 184                      1 1 183 184 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=288 7=32
ReLU             186                      1 1 184 186
Convolution      187                      1 1 186 187 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
ReLU             189                      1 1 187 189
ConvolutionDepthWise 190                      1 1 189 190 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             192                      1 1 190 192
Convolution      193                      1 1 192 193 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ReLU             195                      1 1 193 195
ConvolutionDepthWise 196                      1 1 195 196 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             198                      1 1 196 198
Convolution      199                      1 1 198 199 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ReLU             201                      1 1 199 201
ConvolutionDepthWise 202                      1 1 201 202 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             204                      1 1 202 204
Convolution      205                      1 1 204 205 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ReLU             output1                  1 1 205 output1
Split            splitncnn_0              1 2 output1 output1_splitncnn_0 output1_splitncnn_1
Convolution      208                      1 1 output1_splitncnn_1 208 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=9216
Pooling          209                      1 1 208 209 0=1 4=1
Reshape          217                      1 1 209 217 0=-1
ConvolutionDepthWise 218                      1 1 output1_splitncnn_0 218 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             220                      1 1 218 220
Convolution      221                      1 1 220 221 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
ReLU             223                      1 1 221 223
ConvolutionDepthWise 224                      1 1 223 224 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             226                      1 1 224 226
Convolution      227                      1 1 226 227 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             229                      1 1 227 229
ConvolutionDepthWise 230                      1 1 229 230 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             232                      1 1 230 232
Convolution      233                      1 1 232 233 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             235                      1 1 233 235
ConvolutionDepthWise 236                      1 1 235 236 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             238                      1 1 236 238
Convolution      239                      1 1 238 239 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
ReLU             241                      1 1 239 241
ConvolutionDepthWise 242                      1 1 241 242 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
ReLU             244                      1 1 242 244
Convolution      245                      1 1 244 245 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
ReLU             247                      1 1 245 247
Split            splitncnn_1              1 2 247 247_splitncnn_0 247_splitncnn_1
Convolution      248                      1 1 247_splitncnn_1 248 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
Pooling          249                      1 1 248 249 0=1 4=1
Reshape          257                      1 1 249 257 0=-1
Convolution      258                      1 1 247_splitncnn_0 258 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             259                      1 1 258 259
ConvolutionDepthWise 260                      1 1 259 260 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             261                      1 1 260 261
Convolution      262                      1 1 261 262 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
Pooling          263                      1 1 262 263 0=1 4=1
Reshape          271                      1 1 263 271 0=-1
Concat           272                      3 1 217 257 271 272 0=0
InnerProduct     output                   1 1 272 output 0=212 1=1 2=44096
