7767517
246 268
Input            input                    0 1 input
MemoryData       322                      0 1 322 0=2
MemoryData       323                      0 1 323 0=2
MemoryData       336                      0 1 336 0=2
MemoryData       337                      0 1 337 0=2
MemoryData       368                      0 1 368 0=2
MemoryData       369                      0 1 369 0=2
MemoryData       382                      0 1 382 0=2
MemoryData       383                      0 1 383 0=2
MemoryData       408                      0 1 408 0=2
MemoryData       409                      0 1 409 0=2
MemoryData       422                      0 1 422 0=2
MemoryData       423                      0 1 423 0=2
MemoryData       440                      0 1 440 0=2
MemoryData       441                      0 1 441 0=2
MemoryData       452                      0 1 452 0=2
MemoryData       453                      0 1 453 0=2
MemoryData       465                      0 1 465 0=2 1=4420
MemoryData       467                      0 1 467 0=2 1=4420
MemoryData       473                      0 1 473 0=2 1=4420
Convolution      245                      1 1 input 245 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=432
BatchNorm        246                      1 1 245 246 0=16
ReLU             247                      1 1 246 247
ConvolutionDepthWise 248                      1 1 247 248 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=144 7=16
BatchNorm        249                      1 1 248 249 0=16
ReLU             250                      1 1 249 250
Convolution      251                      1 1 250 251 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=512
BatchNorm        252                      1 1 251 252 0=32
ReLU             253                      1 1 252 253
ConvolutionDepthWise 254                      1 1 253 254 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=288 7=32
BatchNorm        255                      1 1 254 255 0=32
ReLU             256                      1 1 255 256
Convolution      257                      1 1 256 257 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1024
BatchNorm        258                      1 1 257 258 0=32
ReLU             259                      1 1 258 259
ConvolutionDepthWise 260                      1 1 259 260 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=288 7=32
BatchNorm        261                      1 1 260 261 0=32
ReLU             262                      1 1 261 262
Convolution      263                      1 1 262 263 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1024
BatchNorm        264                      1 1 263 264 0=32
ReLU             265                      1 1 264 265
ConvolutionDepthWise 266                      1 1 265 266 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=288 7=32
BatchNorm        267                      1 1 266 267 0=32
ReLU             268                      1 1 267 268
Convolution      269                      1 1 268 269 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=2048
BatchNorm        270                      1 1 269 270 0=64
ReLU             271                      1 1 270 271
ConvolutionDepthWise 272                      1 1 271 272 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=576 7=64
BatchNorm        273                      1 1 272 273 0=64
ReLU             274                      1 1 273 274
Convolution      275                      1 1 274 275 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4096
BatchNorm        276                      1 1 275 276 0=64
ReLU             277                      1 1 276 277
ConvolutionDepthWise 278                      1 1 277 278 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=576 7=64
BatchNorm        279                      1 1 278 279 0=64
ReLU             280                      1 1 279 280
Convolution      281                      1 1 280 281 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4096
BatchNorm        282                      1 1 281 282 0=64
ReLU             283                      1 1 282 283
Split            splitncnn_0              1 4 283 283_splitncnn_0 283_splitncnn_1 283_splitncnn_2 283_splitncnn_3
Convolution      284                      1 1 283_splitncnn_3 284 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=512
BatchNorm        285                      1 1 284 285 0=8
Convolution      286                      1 1 285 286 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1152
BatchNorm        287                      1 1 286 287 0=16
ReLU             288                      1 1 287 288
Convolution      289                      1 1 288 289 0=16 1=3 11=3 2=2 12=2 3=1 13=1 4=2 14=2 15=2 16=2 5=0 6=2304
BatchNorm        290                      1 1 289 290 0=16
Convolution      291                      1 1 283_splitncnn_2 291 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=512
BatchNorm        292                      1 1 291 292 0=8
Convolution      293                      1 1 292 293 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1152
BatchNorm        294                      1 1 293 294 0=16
ReLU             295                      1 1 294 295
Convolution      296                      1 1 295 296 0=16 1=3 11=3 2=3 12=3 3=1 13=1 4=3 14=3 15=3 16=3 5=0 6=2304
BatchNorm        297                      1 1 296 297 0=16
Convolution      298                      1 1 283_splitncnn_1 298 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=512
BatchNorm        299                      1 1 298 299 0=8
Convolution      300                      1 1 299 300 0=12 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=864
BatchNorm        301                      1 1 300 301 0=12
ReLU             302                      1 1 301 302
Convolution      303                      1 1 302 303 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1728
BatchNorm        304                      1 1 303 304 0=16
ReLU             305                      1 1 304 305
Convolution      306                      1 1 305 306 0=16 1=3 11=3 2=5 12=5 3=1 13=1 4=5 14=5 15=5 16=5 5=0 6=2304
BatchNorm        307                      1 1 306 307 0=16
Concat           308                      3 1 290 297 307 308 0=0
Convolution      309                      1 1 308 309 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=3072
BatchNorm        310                      1 1 309 310 0=64
Convolution      311                      1 1 283_splitncnn_0 311 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4096
BatchNorm        312                      1 1 311 312 0=64
BinaryOp         313                      2 1 310 312 313 0=0
ReLU             314                      1 1 313 314
Split            splitncnn_1              1 3 314 314_splitncnn_0 314_splitncnn_1 314_splitncnn_2
ConvolutionDepthWise 315                      1 1 314_splitncnn_2 315 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             316                      1 1 315 316
Convolution      317                      1 1 316 317 0=6 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=384
Permute          318                      1 1 317 318 0=3
Split            splitncnn_2              1 2 318 318_splitncnn_0 318_splitncnn_1
Shape            320                      1 1 318_splitncnn_1 320
Crop             321                      1 1 320 321 -23309=1,0 -23310=1,1 -23311=1,-1
ExpandDims       324                      1 1 321 324 -23303=1,0
ExpandDims       325                      1 1 322 325 -23303=1,0
ExpandDims       326                      1 1 323 326 -23303=1,0
Concat           327                      3 1 324 325 326 327 0=0
Reshape          328                      2 1 318_splitncnn_0 327 328
ConvolutionDepthWise 329                      1 1 314_splitncnn_1 329 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             330                      1 1 329 330
Convolution      331                      1 1 330 331 0=12 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=768
Permute          332                      1 1 331 332 0=3
Split            splitncnn_3              1 2 332 332_splitncnn_0 332_splitncnn_1
Shape            334                      1 1 332_splitncnn_1 334
Crop             335                      1 1 334 335 -23309=1,0 -23310=1,1 -23311=1,-1
ExpandDims       338                      1 1 335 338 -23303=1,0
ExpandDims       339                      1 1 336 339 -23303=1,0
ExpandDims       340                      1 1 337 340 -23303=1,0
Concat           341                      3 1 338 339 340 341 0=0
Reshape          342                      2 1 332_splitncnn_0 341 342
ConvolutionDepthWise 343                      1 1 314_splitncnn_0 343 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=576 7=64
BatchNorm        344                      1 1 343 344 0=64
ReLU             345                      1 1 344 345
Convolution      346                      1 1 345 346 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=8192
BatchNorm        347                      1 1 346 347 0=128
ReLU             348                      1 1 347 348
ConvolutionDepthWise 349                      1 1 348 349 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1152 7=128
BatchNorm        350                      1 1 349 350 0=128
ReLU             351                      1 1 350 351
Convolution      352                      1 1 351 352 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
BatchNorm        353                      1 1 352 353 0=128
ReLU             354                      1 1 353 354
ConvolutionDepthWise 355                      1 1 354 355 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=1152 7=128
BatchNorm        356                      1 1 355 356 0=128
ReLU             357                      1 1 356 357
Convolution      358                      1 1 357 358 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
BatchNorm        359                      1 1 358 359 0=128
ReLU             360                      1 1 359 360
Split            splitncnn_4              1 3 360 360_splitncnn_0 360_splitncnn_1 360_splitncnn_2
ConvolutionDepthWise 361                      1 1 360_splitncnn_2 361 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             362                      1 1 361 362
Convolution      363                      1 1 362 363 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Permute          364                      1 1 363 364 0=3
Split            splitncnn_5              1 2 364 364_splitncnn_0 364_splitncnn_1
Shape            366                      1 1 364_splitncnn_1 366
Crop             367                      1 1 366 367 -23309=1,0 -23310=1,1 -23311=1,-1
ExpandDims       370                      1 1 367 370 -23303=1,0
ExpandDims       371                      1 1 368 371 -23303=1,0
ExpandDims       372                      1 1 369 372 -23303=1,0
Concat           373                      3 1 370 371 372 373 0=0
Reshape          374                      2 1 364_splitncnn_0 373 374
ConvolutionDepthWise 375                      1 1 360_splitncnn_1 375 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             376                      1 1 375 376
Convolution      377                      1 1 376 377 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
Permute          378                      1 1 377 378 0=3
Split            splitncnn_6              1 2 378 378_splitncnn_0 378_splitncnn_1
Shape            380                      1 1 378_splitncnn_1 380
Crop             381                      1 1 380 381 -23309=1,0 -23310=1,1 -23311=1,-1
ExpandDims       384                      1 1 381 384 -23303=1,0
ExpandDims       385                      1 1 382 385 -23303=1,0
ExpandDims       386                      1 1 383 386 -23303=1,0
Concat           387                      3 1 384 385 386 387 0=0
Reshape          388                      2 1 378_splitncnn_0 387 388
ConvolutionDepthWise 389                      1 1 360_splitncnn_0 389 0=128 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=0 6=1152 7=128
BatchNorm        390                      1 1 389 390 0=128
ReLU             391                      1 1 390 391
Convolution      392                      1 1 391 392 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
BatchNorm        393                      1 1 392 393 0=256
ReLU             394                      1 1 393 394
ConvolutionDepthWise 395                      1 1 394 395 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=0 6=2304 7=256
BatchNorm        396                      1 1 395 396 0=256
ReLU             397                      1 1 396 397
Convolution      398                      1 1 397 398 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=65536
BatchNorm        399                      1 1 398 399 0=256
ReLU             400                      1 1 399 400
Split            splitncnn_7              1 3 400 400_splitncnn_0 400_splitncnn_1 400_splitncnn_2
ConvolutionDepthWise 401                      1 1 400_splitncnn_2 401 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
ReLU             402                      1 1 401 402
Convolution      403                      1 1 402 403 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
Permute          404                      1 1 403 404 0=3
Split            splitncnn_8              1 2 404 404_splitncnn_0 404_splitncnn_1
Shape            406                      1 1 404_splitncnn_1 406
Crop             407                      1 1 406 407 -23309=1,0 -23310=1,1 -23311=1,-1
ExpandDims       410                      1 1 407 410 -23303=1,0
ExpandDims       411                      1 1 408 411 -23303=1,0
ExpandDims       412                      1 1 409 412 -23303=1,0
Concat           413                      3 1 410 411 412 413 0=0
Reshape          414                      2 1 404_splitncnn_0 413 414
ConvolutionDepthWise 415                      1 1 400_splitncnn_1 415 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
ReLU             416                      1 1 415 416
Convolution      417                      1 1 416 417 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
Permute          418                      1 1 417 418 0=3
Split            splitncnn_9              1 2 418 418_splitncnn_0 418_splitncnn_1
Shape            420                      1 1 418_splitncnn_1 420
Crop             421                      1 1 420 421 -23309=1,0 -23310=1,1 -23311=1,-1
ExpandDims       424                      1 1 421 424 -23303=1,0
ExpandDims       425                      1 1 422 425 -23303=1,0
ExpandDims       426                      1 1 423 426 -23303=1,0
Concat           427                      3 1 424 425 426 427 0=0
Reshape          428                      2 1 418_splitncnn_0 427 428
Convolution      429                      1 1 400_splitncnn_0 429 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             430                      1 1 429 430
ConvolutionDepthWise 431                      1 1 430 431 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             432                      1 1 431 432
Convolution      433                      1 1 432 433 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             434                      1 1 433 434
Split            splitncnn_10             1 2 434 434_splitncnn_0 434_splitncnn_1
Convolution      435                      1 1 434_splitncnn_1 435 0=6 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=13824
Permute          436                      1 1 435 436 0=3
Split            splitncnn_11             1 2 436 436_splitncnn_0 436_splitncnn_1
Shape            438                      1 1 436_splitncnn_1 438
Crop             439                      1 1 438 439 -23309=1,0 -23310=1,1 -23311=1,-1
ExpandDims       442                      1 1 439 442 -23303=1,0
ExpandDims       443                      1 1 440 443 -23303=1,0
ExpandDims       444                      1 1 441 444 -23303=1,0
Concat           445                      3 1 442 443 444 445 0=0
Reshape          446                      2 1 436_splitncnn_0 445 446
Convolution      447                      1 1 434_splitncnn_0 447 0=12 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=27648
Permute          448                      1 1 447 448 0=3
Split            splitncnn_12             1 2 448 448_splitncnn_0 448_splitncnn_1
Shape            450                      1 1 448_splitncnn_1 450
Crop             451                      1 1 450 451 -23309=1,0 -23310=1,1 -23311=1,-1
ExpandDims       454                      1 1 451 454 -23303=1,0
ExpandDims       455                      1 1 452 455 -23303=1,0
ExpandDims       456                      1 1 453 456 -23303=1,0
Concat           457                      3 1 454 455 456 457 0=0
Reshape          458                      2 1 448_splitncnn_0 457 458
Concat           459                      4 1 328 374 414 446 459 0=0
Concat           460                      4 1 342 388 428 458 460 0=0
Split            splitncnn_13             1 2 460 460_splitncnn_0 460_splitncnn_1
Softmax          scores                   1 1 459 scores 0=1 1=1
Crop             462                      1 1 460_splitncnn_1 462 -23309=1,0 -23310=1,2 -23311=1,1
BinaryOp         464                      1 1 462 464 0=2 1=1 2=1.000000e-01
BinaryOp         466                      2 1 464 465 466 0=2
BinaryOp         468                      2 1 466 467 468 0=0
Crop             469                      1 1 460_splitncnn_0 469 -23309=1,2 -23310=1,2147483647 -23311=1,1
BinaryOp         471                      1 1 469 471 0=2 1=1 2=2.000000e-01
UnaryOp          472                      1 1 471 472 0=7
BinaryOp         474                      2 1 472 473 474 0=2
Concat           475                      2 1 468 474 475 0=1
Split            splitncnn_14             1 4 475 475_splitncnn_0 475_splitncnn_1 475_splitncnn_2 475_splitncnn_3
Crop             476                      1 1 475_splitncnn_3 476 -23309=1,0 -23310=1,2 -23311=1,1
Crop             477                      1 1 475_splitncnn_2 477 -23309=1,2 -23310=1,2147483647 -23311=1,1
BinaryOp         479                      1 1 477 479 0=3 1=1 2=2.000000e+00
BinaryOp         480                      2 1 476 479 480 0=1
Crop             481                      1 1 475_splitncnn_1 481 -23309=1,0 -23310=1,2 -23311=1,1
Crop             482                      1 1 475_splitncnn_0 482 -23309=1,2 -23310=1,2147483647 -23311=1,1
BinaryOp         484                      1 1 482 484 0=3 1=1 2=2.000000e+00
BinaryOp         485                      2 1 481 484 485 0=0
Concat           boxes                    2 1 480 485 boxes 0=1
